Autodesk.Navisworks.Api.ModelItemEnumerableCollection
Collection of ModelItems that only supports Enumerable style interfaces

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.#ctor
Default constructor for ModelItemEnumerableCollection

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.CopyTo(System.Collections.Generic.ICollection{Autodesk.Navisworks.Api.ModelItem})
Enumerates over the collection and copies the items into to
to: Collection to copy into

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.Empty
Returns an empty ModelItemEnumerableCollection

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.First
Returns the first item in the enumeration, returns null if the collection is empty

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.Where(Autodesk.Navisworks.Api.SearchCondition)
Filters the items based on a search condition

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.Where(Autodesk.Navisworks.Api.SearchConditionCollection)
Filters the instances based on a set of search conditions

Autodesk.Navisworks.Api.ModelItemEnumerableCollection.WhereInstanceGuid(System.Guid)
Filters the instances to those with given InstanceGuid